{ "posts": [{
    "title": "Your Guide to Utilizing Spring Produce",
    "author": "Tammy Dang",
    "date": "March 21, 2017",
    "image": "http://food.fnr.sndimg.com/content/dam/images/food/fullset/2011/3/1/0/FNM_040111-WN-Dinners-030_s4x3.jpg.rend.hgtvcom.616.462.jpeg",
    "content": "<p>Spring is a great time to hit the reset button and reintroduce some fresh foods into your kids' diet after a long winter. Get into the swing of spring produce with these four seasonal favorites.<br>Spinach<br>Spinach is called a superfood for a reason: It's packed with vitamins A and C, which are essential for eye health, immune function and many other body processes. Vitamin K helps build strong bones. Spinach also contains folate and iron, which help prevent anemia. The magnesium and potassium are important for muscle development and growth.<br>If your kids are on-board with green stuff, serve spinach salads or add it to smoothies. Serve it sautéed with meat and fish. For veggie avoiders, the mild flavor of spinach is easily masked. Just puree and mix it into sauces, soups and meatballs.<br>Yogurt<br>A calcium-rich food, yogurt is important for building strong bones and teeth. At eight grams per 6 ounce container, yogurt is also a great source of protein. Greek yogurt has up to twice that much, however it provides less calcium. Yogurt is also a good source of probiotic bacteria, which can promote good digestion and immune system function.<br>'Have your kids help make yogurt parfaits by layering yogurt, cereal and fruit,' suggests Lisa Brown, MS, RD, CDN, a registered dietitian in New York City. 'If your kids are adventurous, have them top their pancakes and waffles with yogurt and fruit instead of syrup.'<br>Strawberries<br>Loaded with vitamins, minerals and phytonutrients, fresh strawberries are a seasonal superstar. Just one cup provides more than a day's worth of vitamin C, plus a hearty dose of manganese, which is important for bone development. A serving of strawberries also packs three grams of fiber.<br>Strawberries are great eaten plain or with other foods. 'Sweet and colorful, berries are a great addition to smoothies, cereal and yogurt,' says Brown.<br>Asparagus<br>Asparagus is an excellent source of bone-building vitamin K as well as folate. It also provides vitamin A and iron. Available in green, purple and white varieties, asparagus spears are fun to eat and go with all kinds of foods.<br>Pediatric nutritionist Laura Gibofsky, MS, RD, CDN, suggests rolling asparagus in egg and panko crumbs and baking on a cookie sheet as a kid-friendly prep method. You can also add Parmesan cheese to the panko crumbs for a cheesy variation. Serve with teriyaki or tomato sauce for dipping or even a small amount of low-fat ranch dressing. This is also a great way to prepare broccoli, and is easy enough for the kids to help prepare. 'Getting kids involved in the kitchen will make them more likely to try new foods,' Gibofsky says.</p>"
  }, {
    "title": "4 Types of Foods to Help Boost Your Memory",
    "author": "Renee Mei",
    "date": "March 22, 2017",
    "image":"http://www.eatright.org/~/media/eatrightimages/health/wellness/healthyaging/4typesoffoodstohelpboostyourmemory.ashx?h=450&w=600",
    "content": "If you're feeling forgetful, it could be due to a lack of sleep or a number of other reasons, including genetics, level of physical activity and lifestyle and environmental factors. However, there's no doubt that diet plays a major role in brain health.<br>The best menu for boosting memory and brain function encourages good blood flow to the brain — much like what you'd eat to nourish and protect your heart. Research found the Mediterranean Diet helps in keeping aging brains sharp, and a growing body of evidence links foods like those in the Mediterranean diet with better cognitive function, memory and alertness.<br>Eat your veggies. You're not likely to forget this message. Getting adequate vegetables, especially cruciferous ones including broccoli, cabbage and dark leafy greens, may help improve memory. Try a kale salad or substitute collard greens for a tortilla in your next sandwich wrap. Broccoli stir-fry is also an excellent option for lunch or dinner.<br>Be sweet on berries and cherries. Berries — especially dark ones such as blackberries, blueberries and cherries — are a rich source of anthocyanins and other flavonoids that may boost memory function. Enjoy a handful of berries for a snack, mixed into cereal or baked into an antioxidant-rich dessert. You can reap these benefits from fresh, frozen or dried berries and cherries.<br>Get adequate omega-3 fatty acids. Essential for good brain health, omega-3 fatty acids, docosahexaenoic acid (DHA) in particular, may help improve memory in healthy young adults. \"DHA is the most abundant fatty acid in the brain. It makes sense that if you have higher levels of DHA in the blood, then the brain will operate more efficiently,\" says Andrea Giancoli, RD, registered dietitian and past Academy of Nutrition and Dietetics spokesperson (2005-2014).<br>Seafood, algae and fatty fish — including salmon, bluefin tuna, sardines and herring — are some of the best sources of omega-3 fatty acids. Substitute fish for meat a couple of times each week to get a healthy dose. Grill, bake or broil fish for ultimate flavor and health. Try salmon tacos with red cabbage slaw, snack on sardines or enjoy seared tuna on salad greens for dinner. If you don't eat fish, discuss other food options and supplementation with your doctor or registered dietitian nutritionist. You can get omega-3 fatty acids from fish oil, seaweed or microalgae supplements.<br>Work in walnuts. Well known for a positive impact on heart health, walnuts also may improve working memory. Snack on a handful of walnuts to satisfy midday hunger, add them to oatmeal or salad for crunch or mix them into a vegetable stir-fry for extra protein.<br>These foods are not just good for the brain, they sustain a healthy heart and all parts of the body. While there's no guarantee that these foods will help you remember where you put your keys tomorrow, over time they can support lifelong good health."
}, {
  "title": "Healthy Baking Alternatives",
  "author": "Tammy Dang",
  "date": "March 22, 2017",
  "image": "http://www.lottieanddoof.com/wp-content/uploads/2009/11/IMG_2442.JPG",
  "content": "According to the 2015-2020 Dietary Guidelines for Americans, a healthy diet limits the amount of calories people should consume from added sugars and saturated fat. Does that mean no desserts?<br>While many baked goods are a major source of both added sugars and saturated fat, dessert still can be an enjoyable part of a full and well-balanced eating pattern. Follow these tips for delicious baked goods with more healthy nutrients and less added sugar and saturated fat.<br>Watch Portion Size<br>Keeping portion sizes in check is a primary strategy for healthfully incorporating baked goods into a healthy eating pattern. Make portion control easier by preparing miniature desserts such as mini-cupcakes. Or cut brownies and sheet cakes into two-inch squares and portion cookie dough using a one-tablespoon scoop.<br>Ingredients Matter<br>Use high-quality ingredients for a more flavorful product that will satisfy cravings even with smaller portions. For example, use vanilla beans instead of extract, opt for high-quality chocolate and make sure your spices are fresh for the boldest flavor.<br>Incorporate Nutrient-Rich Ingredients<br>Instead of focusing on what to cut out, why not add something nutritious to your recipe?<br>Add a Fruit or Vegetable<br>Try adding shredded or pureed apple, carrot, banana and pumpkin to recipes to boost nutrients, flavor and moisture. For some recipes, you can use these ingredients to replace some or all of the butter or oil.<br>Try a Whole-Grain Flour<br>White whole-wheat flour can be substituted one-for-one for all-purpose flour in most recipes. You also can replace up to half the all-purpose flour in a recipe with a whole-grain flour without making any major adjustments to the recipe.<br>Experiment with Recipes That Use Less-Common Flours<br>Try experimenting with recipes such as savory pancakes and waffles that call for chickpea flour. Or try recipes with almond flour, which works well for crusts and can be incorporated into dough for a big punch of flavor and added nutrients.<br>Use Low-Fat Dairy Products<br>Use low-fat milk, low-fat buttermilk and low-fat yogurt in baking recipes to contribute protein and calcium. Consider swapping cream cheese frosting, which is high in calories and saturated fat and has minimal nutritional value, for a protein-rich frosting made from Greek yogurt.<br>Reduce Saturated Fat and Added Sugars<br>You can do this in a number of ways. For instance, try these modifications:<br>Swap Butter for Heart-Healthy Oil<br>When modifying a favorite recipe, you generally can trade some of the butter for a heart-healthy oil, such as canola oil. Don't replace all of the butter with oil or you'll sacrifice texture.<br>Simply Cut Sugar<br>As a general rule, you can reduce sugar in a given recipe by about 25 percent without noticeable differences. For instance, if a recipe calls for 4 tablespoons of sugar, reduce the amount to 3 tablespoons. When reducing sugar, you may need to increase the liquid in a recipe.<br>There is room for all foods, even baked goods, in a healthy eating pattern. Focus on occasionally enjoying small portions of your favorite treats and experiment with creating healthier versions of favorite recipes for more nutrients in each delicious bite."
}
  ]
}
